# RebarBarMaximumBendRadius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarBarMaximumBendRadius Property
ParameterTypeId Class See Also
---
"Maximum Bend Radius"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarBarMaximumBendRadius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarBarMaximumBendRadius As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarBarMaximumBendRadius {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace